Ran Plan for project: `ec2` dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
mise trusted /home/atlantis/.atlantis/repos/pjg3335/atlantis-test/4/default

04:53:28.824 WARN   Config ../vpc/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
04:53:28.825 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/lb_LJliwtGTCEJdstjxUDsYySVE/ma2kK_qqD0KAthqnsyBtZabhBww
04:53:28.858 INFO   tofu: Initializing the backend...
04:53:29.021 INFO   tofu: 
04:53:29.021 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
04:53:29.021 INFO   tofu: use this backend unless the backend configuration changes.
04:53:29.201 INFO   tofu: Initializing provider plugins...
04:53:29.201 INFO   tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
04:53:31.483 INFO   tofu: - Installing hashicorp/aws v6.31.0 to the shared cache directory...
04:54:06.368 INFO   tofu: - Installed hashicorp/aws v6.31.0 (signed, key ID 0C0AF313E5FD9F80)
04:54:06.369 INFO   tofu: - Using hashicorp/aws v6.31.0 from the shared cache directory
04:54:06.370 INFO   tofu: Providers are signed by their developers.
04:54:06.370 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
04:54:06.370 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
04:54:06.370 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
04:54:06.370 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
04:54:06.370 INFO   tofu: version control system if they represent changes you intended to make.
04:54:06.371 INFO   tofu: OpenTofu has been successfully initialized!
04:54:08.302 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
04:54:08.302 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
04:54:08.302 STDOUT tofu:   + create
04:54:08.302 STDOUT tofu: OpenTofu will perform the following actions:
04:54:08.302 STDOUT tofu:   # aws_instance.web will be created
04:54:08.302 STDOUT tofu:   + resource "aws_instance" "web" {
04:54:08.302 STDOUT tofu:       + ami                                  = "ami-0092e0c93f74c293a"
04:54:08.302 STDOUT tofu:       + arn                                  = (known after apply)
04:54:08.302 STDOUT tofu:       + associate_public_ip_address          = (known after apply)
04:54:08.302 STDOUT tofu:       + availability_zone                    = (known after apply)
04:54:08.302 STDOUT tofu:       + disable_api_stop                     = (known after apply)
04:54:08.302 STDOUT tofu:       + disable_api_termination              = (known after apply)
04:54:08.302 STDOUT tofu:       + ebs_optimized                        = (known after apply)
04:54:08.302 STDOUT tofu:       + enable_primary_ipv6                  = (known after apply)
04:54:08.302 STDOUT tofu:       + force_destroy                        = false
04:54:08.302 STDOUT tofu:       + get_password_data                    = false
04:54:08.302 STDOUT tofu:       + host_id                              = (known after apply)
04:54:08.302 STDOUT tofu:       + host_resource_group_arn              = (known after apply)
04:54:08.303 STDOUT tofu:       + iam_instance_profile                 = (known after apply)
04:54:08.303 STDOUT tofu:       + id                                   = (known after apply)
04:54:08.303 STDOUT tofu:       + instance_initiated_shutdown_behavior = (known after apply)
04:54:08.303 STDOUT tofu:       + instance_lifecycle                   = (known after apply)
04:54:08.303 STDOUT tofu:       + instance_state                       = (known after apply)
04:54:08.303 STDOUT tofu:       + instance_type                        = "t3.micro"
04:54:08.303 STDOUT tofu:       + ipv6_address_count                   = (known after apply)
04:54:08.303 STDOUT tofu:       + ipv6_addresses                       = (known after apply)
04:54:08.303 STDOUT tofu:       + key_name                             = (known after apply)
04:54:08.303 STDOUT tofu:       + monitoring                           = (known after apply)
04:54:08.303 STDOUT tofu:       + outpost_arn                          = (known after apply)
04:54:08.303 STDOUT tofu:       + password_data                        = (known after apply)
04:54:08.303 STDOUT tofu:       + placement_group                      = (known after apply)
04:54:08.303 STDOUT tofu:       + placement_group_id                   = (known after apply)
04:54:08.303 STDOUT tofu:       + placement_partition_number           = (known after apply)
04:54:08.303 STDOUT tofu:       + primary_network_interface_id         = (known after apply)
04:54:08.303 STDOUT tofu:       + private_dns                          = (known after apply)
04:54:08.303 STDOUT tofu:       + private_ip                           = (known after apply)
04:54:08.303 STDOUT tofu:       + public_dns                           = (known after apply)
04:54:08.303 STDOUT tofu:       + public_ip                            = (known after apply)
04:54:08.303 STDOUT tofu:       + region                               = "ap-northeast-2"
04:54:08.303 STDOUT tofu:       + secondary_private_ips                = (known after apply)
04:54:08.303 STDOUT tofu:       + security_groups                      = (known after apply)
04:54:08.303 STDOUT tofu:       + source_dest_check                    = true
04:54:08.303 STDOUT tofu:       + spot_instance_request_id             = (known after apply)
04:54:08.303 STDOUT tofu:       + subnet_id                            = "subnet-123456789"
04:54:08.303 STDOUT tofu:       + tags                                 = {
04:54:08.303 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
04:54:08.303 STDOUT tofu:         }
04:54:08.303 STDOUT tofu:       + tags_all                             = {
04:54:08.303 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
04:54:08.303 STDOUT tofu:         }
04:54:08.303 STDOUT tofu:       + tenancy                              = (known after apply)
04:54:08.303 STDOUT tofu:       + user_data_base64                     = (known after apply)
04:54:08.304 STDOUT tofu:       + user_data_replace_on_change          = false
04:54:08.304 STDOUT tofu:       + vpc_security_group_ids               = (known after apply)
04:54:08.304 STDOUT tofu:       + capacity_reservation_specification (known after apply)
04:54:08.304 STDOUT tofu:       + cpu_options (known after apply)
04:54:08.304 STDOUT tofu:       + ebs_block_device (known after apply)
04:54:08.304 STDOUT tofu:       + enclave_options (known after apply)
04:54:08.304 STDOUT tofu:       + ephemeral_block_device (known after apply)
04:54:08.304 STDOUT tofu:       + instance_market_options (known after apply)
04:54:08.304 STDOUT tofu:       + maintenance_options (known after apply)
04:54:08.304 STDOUT tofu:       + metadata_options (known after apply)
04:54:08.304 STDOUT tofu:       + network_interface (known after apply)
04:54:08.304 STDOUT tofu:       + primary_network_interface (known after apply)
04:54:08.304 STDOUT tofu:       + private_dns_name_options (known after apply)
04:54:08.304 STDOUT tofu:       + root_block_device (known after apply)
04:54:08.304 STDOUT tofu:     }
04:54:08.304 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
04:54:08.304 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.testdragon.dev/lock?id=pjg3335%252Fatlantis-test%252Fec2%252Fdefault%252Fec2)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ec2
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```